
{"id":"https://openalex.org/G1000033722","funder_award_id":"332781","funded_outputs":["https://openalex.org/W4409067164"],"funded_outputs_count":1,"title":"Création d'un cadre d'apprentissage fédéré \"open-source\" et évolutif pour l'IRM du cerveau et de la moelle épinière afin d'améliorer les prédictions de la sclérose en plaques","description":"La sclérose en plaques (SP) est une maladie inflammatoire auto-immune du système nerveux central, qui peut entraîner des déficits moteurs, sensoriels et cognitifs. La SP se caractérise par la présence de lésions visibles à l'imagerie par résonance magnétique (IRM). Bien qu'il n'existe actuellement aucun remède contre la SP, le potentiel de traitement est facilité par une meilleure caractérisation de la maladie. En particulier, être capable de quantifier les lésions de SP dans le cerveau et la moelle épinière serait extrêmement utile pour les cliniciens pour savoir si l'état d'un patient va s'améliorer ou s'aggraver. La quantification des lésions de SP ne fait actuellement pas partie de la routine en clinique en raison du temps élevé requis par les radiologues pour segmenter chaque lésion de SP sur les IRMs. La segmentation automatique des lésions de SP avec apprentissage en profondeur a désormais dépassé les méthodes d'analyse d'images traditionnelles de pointe. Cependant, des études récentes montrent que si les méthodes d'apprentissage en profondeur fonctionnent bien sur des ensembles de données organisés sur un seul site (e.g. un hôpital), elles ne parviennent pas à se généraliser aux données acquises dans plusieurs hôpitaux, ce qui entrave l'utilisation de ces algorithmes avancés dans la routine clinique générale. Une façon d'améliorer la généralisabilité de ces algorithmes consiste à regrouper les données IRMs de plusieurs hôpitaux et à entraîner un \"super modèle\" qui serait exposé aux images de plusieurs hôpitaux. Étant donné que le partage d'images de patients sensibles est très restreint, il existe une approche intéressante qui consiste plutôt à partager les paramètres des modèles entraînés localement. Cette stratégie s'appelle l'apprentissage fédéré (FL), et notre collaborateur, le Dr Michael Chassé, dirige une infrastructure FL agissant comme preuve de concept appelée CODA-19 (https://coda19.com/).\n\nMon objectif est de mettre en œuvre un cadre d'apprentissage fédéré (FL) complet, open-source et durable pour la segmentation des lésions de SP à partir de données IRMs. Je tirerai parti des forces et des ressources de recherche existantes en étendant CODA-19 pour y accueillir les données d'IRMs et en développant un modèle général et robuste de segmentation des lésions de SP basé sur les données des hôpitaux collaboratifs du Québec.","amount":100000.0,"currency":"CAD","funder_id":"https://openalex.org/F4320331165","funder_name":"Fonds de recherche du Québec","funding_type":"award","funder_scheme":null,"funder_ids":{"ror_id":"https://ror.org/00w3qhf76","doi":null},"start_date":"2023-05-15","end_date":"2024-05-14","planned_end_date":null,"accepted_date":null,"approved_date":null,"issued_date":"2023-05-15","landing_page":"https://repertoire.frq.gouv.qc.ca/offres/detailOffres.do?methode=consulter&demId=332781","doi_url":"https://doi.org/10.69777/332781","doi":"10.69777/332781","publisher":"Fonds de recherche du Québec","member_id":"50067","provenance":"crossref","lead_investigator":{"given_name":"Louis-François","family_name":"Bouchard","orcid":null,"role_start":"2023-05-15","affiliation":{"name":"Polytechnique Montréal","country":null,"ids":[{"id":"https://ror.org/05f8d4e86","type":"ROR","asserted_by":"publisher"}]}},"co_lead_investigator":null,"investigators":null,"deposited_timestamp":"2025-05-23T21:08:24","created_timestamp":"2025-04-01T12:56:00","indexed_timestamp":"2025-05-24T04:22:56"}